<template>
  <div class="user_agreement">
    <header id="header" class="mui-bar mui-bar-nav">
      <a class="mui-action-back mui-icon mui-icon-left-nav mui-pull-left"></a>
      <h1 class="mui-title">掌柜当家用户服务协议</h1>
    </header>
    <div class="content">
      <dl>
        <dd>1、掌柜当家用户服务协议》（以下简称“本协议”）由注册“掌柜当家”并在“掌柜当家”进行商品采购、销售的用户（以下简称“用户”）与“掌柜当家”共同缔结，具有合同效力。</dd>
        <dd>2、用户一经勾选“我同意《掌柜当家用户服务协议》”并点击“同意协议”按键，即意味着用户同意与掌柜当家自愿签订本协议并受本协议约束，本协议立即并成为对双方有约束力的法律文件。在用户采购商品过程中，如有纠纷（例如包装破损、质量、规格标准、商品详情图片不符等），双方依据买卖合同关系、本协议及掌柜当家相关规则解决。用户注册成为“掌柜当家”用户勾选的其他协议同样具有约束力。如掌柜当家与用户另行签署线下纸质版协议，用户还应遵守线下协议，该线下协议与本协议发生冲突时，以线下协议为准，或双方协商确定。</dd>
        <dd>3、用户使用掌柜当家进行商品采购，须同时遵守公示于掌柜当家的各项规则。</dd>
        <dd>4、本协议各条款的标题仅为方便阅读而设立，不做本协议条款的定义或解释之用。</dd>
      </dl>
      <dl>
        <dt>定义和解释</dt>
        <dd>1、掌柜当家：指由郑州丝路天语电子商务公司提供技术支持和服务的电子商务平台，包括但不限于：掌柜当家主站以及为掌柜当家用户提供技术服务或运营支持的PC端以及移动端交易平台（简称“掌柜当家”）。</dd>
        <dd>2、用户：是指在掌柜当家完成注册并经资质审核通过取得可在掌柜当家进行货物采购、销售等相关操作的用户。用户可登录其账号进行操作，包括但不限于修改账户密码、搜索商品信息、提交采购订单、查询订单状态等。</dd>
        <dd>3、掌柜当家规则：明示于掌柜当家之上的，需要用户实时关注的，与用户采购、销售有关的文件及提示。用户知晓并同意，掌柜当家所有者有权单方面更新、调整掌柜当家规则，用户进一步知晓并同意，如不同意接受调整后的掌柜当家规则，本协议自动终止。</dd>
        <dd>4、订单：订单是指由用户通过掌柜当家提交的对掌柜当家展示商品进行购买，经审核确认后形成的订单。</dd>
      </dl>
      <dl>
        <dt>商品交付</dt>
        <dd>1、配送：用户订购平台上的商品，掌柜当家按双方约定的时间发货。具体到达时间及方式以掌柜当家配送流程为准。</dd>
        <dd>2、收货：用户收到信息（包含单不限于收货地址、联系人以及联系方式等）以用户注册时在“掌柜当家”所提交确认的收货信息进行配送并交付。用户无权拒收商品。因用户提供的收货信息不准确、不完善或临时变更造成的送货延迟或商品损毁等风险，由用户自己承担，给掌柜当家造成的损失，用户应承担相应赔偿责任。</dd>
        <dd>3、交付及验收：掌柜当家依照用户确定的收货信息配送至指定地点并向收货人交付，商品一经签收即视为交付，用户应当场对商品品类、规格、型号、数量和包装等商品表面状况进行验收。用户应及时收取货物，非因确实可证的质量问题不退换货。如零售商家对商品质量有异议的，应于商品交付后三日内向掌柜当家提出，掌柜当家根据实际情况及时处理。</dd>
        <dd>4、结算：用户在掌柜当家提交的有效订单，结算方式应在掌柜当家提示的结算方式范围内自主选择。</dd>
        <dd>5、违规订单处理：为了维护用户的权益，在用户提交订单后，实际签收前，若出现以下非正常订单情形，用户承诺自愿接受掌柜当家按照以下方式进行处理。</dd>
        <dd class="other">1）用户一人或者多人合意使用多个账号下单不支付或者选择延迟发货不正当占用库存；</dd>
        <dd class="other">2）帮助商家刷单或者掌柜当家供应商自买等非正常用户订单；</dd>
        <dd class="other">3）盗取他人账号、银行账号等信息下单购买商品；</dd>
        <dd class="other">4）出现威胁掌柜当家系统安全的行为；</dd>
        <dd class="other">5）出现违反用户注册协议或者掌柜当家平台规则规定的行为；</dd>
        <dd>若出现以上任意一条中的情形，用户承诺自愿接受掌柜当家对非正常订单进行以下任一项或多项操作：</dd>
        <dd class="other">1）删除、取消订单；</dd>
        <dd class="other">2）不发货；</dd>
        <dd class="other">3）对已出库、发货的订单进行拦截、追回；</dd>
        <dd class="other">4）暂时保存异常订单的掌柜当家账号；</dd>
      </dl>
      <dl>
        <dt>注意事项</dt>
        <dd>1、若出现本协议约定的非正常订单情形，如订单被取消、删除、未按照既定时间发货、不发货等，将按照本协议进行处理，若掌柜当家其他规则与本协议约定不一致的，适用本协议约定。</dd>
        <dd>2、若出现本协议约定的非正常订单情形，掌柜当家将采取取消订单、删除订单、不予发货、不向用户提供商品或服务等措施，无任何赔偿。</dd>
        <dd>3、若因本协议中非正常订单原因，订单被取消、删除等，将按照掌柜当家平台规则中的退款流程进行退款。</dd>
        <dd>4、如对订单删除、取消、不发货等情形有疑问，可与掌柜当家客户进行联系。</dd>
      </dl>
      <dl>
        <dt>用户声明及保证</dt>
        <dd>1、保证遵守本协议，依本协议约定及具体订单向掌柜当家付款，不拒收货物，非质量问题不退换货，否则承担相应违约责任。</dd>
        <dd>2、声明并保证订立本协议是用户真实意思表示，具有完全的订立本协议的能力，其代理人（包含但不限于在掌柜当家办理注册的人员、付款人、收货人等）已获取充分的授权，并对其代理人的代理行为承担完全的法律责任，同时保证对其雇员、联系人及其他经其委派的实际履行本协议的人员行为承担完全的法律责任。</dd>
        <dd>3、声明并保证妥善保管其账号及密码，不擅自转让或授权他人使用，并对使用该账户所进行的一切活动视其自身行为，承担全部法律责任。</dd>
        <dd>4、声明保证若从事任何有损掌柜当家及消费者利益的行为，为掌柜当家或者消费者造成实际损失的，用户应承担相应赔偿责任。声明及保证对于以任何形式销售非掌柜当家产品产生的任何问题及后果，承担全部责任。</dd>
      </dl>
      <dl>
        <dt>违约责任</dt>
        <dd>1、用户违反本协议用户声明及保证约定，给掌柜当家带来损失的，应承担相应的赔偿责任，包含单不限于商品经济损失、运费损失、税费损失等。</dd>
        <dd>2、若违反本协议声明及保证责任与本协议外第三方发生争议或受到政府部门查处等给掌柜当家造成影响的，用户应按掌柜当家的要求提供相应的证明材料，必要时，应自行解决或者授权掌柜当家进行处理。由此给掌柜当家造成的实际损失（包含但不限于诉讼费、律师费、赔偿、补偿、行政机关处罚、差旅费等），用户应承担赔偿责任。</dd>
        <dd>3、若有损掌柜当家利益的恶劣行为，如：无故拒收商品，购买正品退假货等恶劣行为的。掌柜当家有权依照本协议和相关法律规定追究其责任，并解除合作冻结账号。</dd>
      </dl>
      <dl>
        <dt>用户信息保护及授权</dt>
        <dd>1、掌柜当家保证不对外公开或向第三方（掌柜当家的关联方除外）提供单个会员的注册资料及会员在使用服务时存储在掌柜当家平台的非公开内容，但下列情况除外：</dd>
        <dd class="other">1）系为履行用户的订单或保护用户的合法权利所必须；</dd>
        <dd class="other">2）相应的法律程序及相关政府部门要求掌柜当家平台提供的。</dd>
        <dd class="other">3）掌柜当家可能会与第三方合作向用户提供相关服务，同时，为了更好向用户提供服务、推荐商品/服务及开展市场调查与信息数据分析等，掌柜当家可能需要向合作方披露用户的相关信息，在此情况下，掌柜当家有权将用户的相关信息提供给该第三方。</dd>
        <dd class="other">4）在不透露单个会员隐私资料的前提下，掌柜当家有权对会员数据库进行分析并对会员数据库进行商业上的利用。</dd>
        <dd class="other">5）为方便用户使用掌柜当家的物流、金融、通讯等相关服务，用户同意并授权掌柜当家将用户在账户注册和使用掌柜当家平台服务过程中提供、形成的信息传递给掌柜当家的其他相关服务提供者，或从掌柜当家其他相关服务提供者获取用户在注册、使用相关服务期间提供、形成的信息。用户同意不会因此追究掌柜当家相关服务提供者的责任。</dd>
      </dl>
      <dl>
        <dt>通知及送达</dt>
        <dd>1、用户在注册成为掌柜当家，并接受掌柜当家服务时，用户应该向掌柜当家提供真实有效的联系方式（包括用户的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，用户有义务及时更新有关信息，并保持可被联系的状态。用户在注册掌柜当家时生成的用于登录掌柜当家接收消息的会员账号，也作为用户的有效联系方式。</dd>
        <dd>2、掌柜当家将向用户的上述联系方式的其中之一或其中若干向用户送达各类通知，而此类通知的内容可能对用户的权利义务产生重大的有利或不利影响，请用户务必及时关注。</dd>
        <dd>3、掌柜当家通过上述联系方式向用户发出通知，其中以电子的方式发出的书面通知，包括但不限于在掌柜当家的公告，向用户提供的联系电话发送手机短信，向用户提供的电子邮件地址发送电子邮件，向用户的客户端推送的消息、系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。</dd>
        <dd>4、对于在掌柜当家上因交易活动引起的任何纠纷，用户同意司法机关（包括但不限于人民法院、仲裁机构）可以通过手机短信、电子邮件等现代通讯方式或邮寄方式向用户送达法律文书（包括但不限于诉讼文书），并同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。</dd>
        <dd>5、用户应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不准确，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由用户自行承担由此可能产生的法律后果。</dd>
      </dl>
      <dl>
        <dt>协议的终止</dt>
        <dd>1、协议双方另行签署书面协议代替本协议的，本协议自动终止。</dd>
        <dd>2、通知终止：除本协议另有约定外，协议任何一方可提前15日以书面形式通知（含电子数据、系统信息等方式）对方终止本协议。</dd>
        <dd>3、用户有下述情形时，掌柜当家可单方面解除本协议：</dd>
        <dd class="other">1）用户无理由拒收货物或退货达两次的；</dd>
        <dd class="other">2）用户刷单、欺诈消费者或者从事任何有损掌柜当家利益的行为；</dd>
        <dd class="other">3）出现本协议约定的掌柜当家有权单方面解除协议情形的；</dd>
        <dd class="other">4）本协议终止之日起三个月内，掌柜当家与用户进行清算，包含但不限于财务对账及在途商品的处理。在途商品指本协议终止前，用户已购买但尚未收到商品，对于此类商品，用户仍按照合同终止前的流程收货及结算。</dd>
      </dl>
      <dl>
        <dt>协议有效期</dt>
        <dd>本协议自生效时起持续有效，至本协议约定之终止事项或解除事项发生时止。</dd>
      </dl>
      <dl>
        <dt>法律适用及争议解决</dt>
        <dd>1、本协议的签订、解释、变更、履行及争议的解决等均适用中华人民共和国大陆地区现行有效的法律。</dd>
        <dd>2、履行本协议过程中产生的任何争议，双方应协商解决；协商不成的，向掌柜当家所在地的人民法院提起诉讼。</dd>
      </dl>
      <dl>
        <dt>其他</dt>
        <dd>1、本协议任何一方未能及时行使本协议的，不应被视为对该权利的放弃，也不影响权利方在将来对该权利的行使。</dd>
        <dd>2、本协议中任何条款无论因何种原因完全或部分的归于无效或不具有执行力，不影响其他条款的法律效力。</dd>
      </dl>
    </div>
  </div>
</template>

<script>
  export default {

  }

</script>

<style lang="less" scoped>
  #header {
    @headerBg: #fff;
    @headerHeight: 50px;
    background: @headerBg;
    height: @headerHeight;

    .mui-pull-left {
      height: @headerHeight;
      line-height: 32px;
      color: #333;
      font-size: 30px;
      font-weight: 400;
    }

    .mui-title {
      color: #333;
      font-weight: bold;
      height: @headerHeight;
      line-height: @headerHeight;
    }
  }

  // 协议内容
  .content {
    margin-top: 50px;
    width: 100%;
    padding-bottom: 1rem;

    img {
      width: 100%;
    }

    dt {
      margin-top: 0.3rem;
      padding-left: 0.3rem;
      font-weight: bold;
      font-size: 0.36rem;
      text-align: left;
      margin-left: 0;
    }

    dd {
      padding: 0.3rem 0.3rem 0;
      font-size: 0.32rem;
      text-align: left;
      line-height: 0.5rem;
      margin-left: 0;
    }

    .other {
      padding-left: 0.6rem;
    }

  }

</style>
